### How to deal with missing value in python

In [1]:
import pandas as pd
import numpy as np

In [10]:
df=pd.read_csv("employees.csv")

df.head()

  First Name  Gender  Salary Bonus % Senior Management             Team
0    Douglas    Male   97308   6.945              TRUE        Marketing
1     Thomas    Male   61933     NaN              TRUE              NaN
2      Maria  Female  130590  11.858             FALSE          Finance
3      Jerry    Male     NaN    9.34              TRUE          Finance
4      Larry    Male  101004   1.389              TRUE  Client Services

In [15]:
df.describe()

       First Name  Gender  Salary Bonus % Senior Management             Team
count         931     852     998     997               932              957
unique        201       3     993     968                 4               13
top       Marilyn  Female  147183   8.999              TRUE  Client Services
freq           11     428       2       3               467              105

In [18]:
df.dtypes

First Name           object
Gender               object
Salary               object
Bonus %              object
Senior Management    object
Team                 object
dtype: object

In [19]:
df['Salary'].head(10)

0     97308
1     61933
2    130590
3       NaN
4    101004
5    115163
6     65476
7     45906
8       NaN
9    139852
Name: Salary, dtype: object

In [20]:
df["Gender"].head(10)

0      Male
1      Male
2    Female
3      Male
4      Male
5      n.a.
6    Female
7    Female
8       NaN
9    Female
Name: Gender, dtype: object

In [28]:
missing_value_formats=["n.a.", "?","NA","n/a","na","--"]

df=pd.read_csv("employees.csv", na_values=missing_value_formats)

In [29]:
df["Gender"].head(10)

0      Male
1      Male
2    Female
3      Male
4      Male
5       NaN
6    Female
7    Female
8       NaN
9    Female
Name: Gender, dtype: object

In [37]:

def make_int(i):
    try:
        return int(i)
    except:
        return pd.np.nan

In [41]:
df["Salary"].isnull().sum()

5

In [43]:
df['Salary']=df['Salary'].map(make_int)
print(df['Salary'].head())

0     97308.0
1     61933.0
2    130590.0
3         NaN
4    101004.0
Name: Salary, dtype: float64

<ipython-input-37-717a91dd0e68>:5: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  return pd.np.nan

In [46]:
df["Gender"].isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: Gender, dtype: bool

In [47]:
df['Gender'].notnull().head()

0    True
1    True
2    True
3    True
4    True
Name: Gender, dtype: bool

In [49]:
#Check if there any missing value in our dataset


df.isnull().values.any()

True

In [50]:
df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [57]:
#drop missing value using dropna function


new_Df=df.dropna(axis=0, how='any')

new_Df.head(10)

,First Name,Gender,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,97308.0,6.945,True,Marketing
2,Maria,Female,130590.0,11.858,False,Finance
4,Larry,Male,101004.0,1.389,True,Client Services
6,Ruby,Female,65476.0,10.012,True,Product
9,Frances,Female,139852.0,7.524,True,Business Development
11,Julie,Female,102508.0,12.637,True,Legal
12,Brandon,Male,112807.0,17.492,True,Human Resources
13,Gary,Male,109831.0,5.831,False,Sales
16,Jeremy,Male,90370.0,7.369,False,Human Resources
18,Diana,Female,132940.0,19.082,False,Client Services

In [59]:
new_Df.isnull().sum()

First Name           0
Gender               0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
dtype: int64

In [61]:
# fill missing value

df["Gender"].fillna("No Gender").head(10)

0         Male
1         Male
2       Female
3         Male
4         Male
5    No Gender
6       Female
7       Female
8    No Gender
9       Female
Name: Gender, dtype: object

In [63]:
#Replaceing Nan value with privous row

df['Salary'].fillna(method="pad").head()

0     97308.0
1     61933.0
2    130590.0
3    130590.0
4    101004.0
Name: Salary, dtype: float64

In [64]:
#Replacing Nan value with next row

df['Salary'].fillna(method="bfill").head()

0     97308.0
1     61933.0
2    130590.0
3    101004.0
4    101004.0
Name: Salary, dtype: float64

In [65]:
#Replace Nan value with mean

df['Salary'].fillna(int(df['Salary'].mean()))

0       97308.0
1       61933.0
2      130590.0
3       90522.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [68]:
#Replace Nan value with meadin

df['Salary'].fillna(int(df['Salary'].median()))

0       97308.0
1       61933.0
2      130590.0
3       90370.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [74]:
#Replace Nan value with mean

mode = df['Salary'].mode()
df['Salary'] = df['Salary'].fillna(mode)

df['Salary']

0       97308.0
1       61933.0
2      130590.0
3      147183.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [75]:
#using repalce value

df['Salary'].replace(to_replace=np.nan, value=0)

0       97308.0
1       61933.0
2      130590.0
3      147183.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [76]:
#interpolate method

df['Salary'].interpolate(method='linear', direction='forward')

0       97308.0
1       61933.0
2      130590.0
3      147183.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64